Yigit Dogan-Effects of Aspect Ratio on Spin-Down/Example Case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type empty;

    }
    lids
    {
        type zeroGradient;

    }
    wall
    {
        type zeroGradient;

    }
    symmetryVer
    {
        type            empty;
    }
    symmetryHor
    {
        type            empty;
    }
}





// ************************************************************************* //
