Yigit Dogan-Effects of Aspect Ratio on Spin-Down/Example Case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//========================
// CONTROLS


h         0.1;
R         1;

// number of cells
Nz   24;
NRinner   96;
NRouter   96;

// size ratio of cell at the wall to the free-stream one in the near-wall blocks

expRatWall    #eval"1/5"; // for BL
expRatWallP   #eval"1/$expRatWall"  ; // for BL

expRatWall2   #eval"1"; // pipe-axis direction


//========================

scale   1;

vertices
(
        (0 0 0)
	(0.8 0 0)
	(1 0 0)
	(6.10532e-01 6.10535e-01 0)
	(0 0.8 0)
	(0 1 0)
	(7.07107e-01 7.07107e-01 0)

	(0 0 $h)
	(0.8 0 $h)
	(1 0 $h)
	(6.10532e-01 6.10535e-01 $h)
	(0 0.8 $h)
	(0 1 $h)
	(7.07107e-01 7.07107e-01 $h)
);

blocks
(
    hex (0 1 3 4 7 8 10 11) ($NRinner $NRouter $Nz) simpleGrading (1 1 $expRatWall2)
    hex (6 5 4 3 13 12 11 10) ($NRinner $NRouter $Nz) simpleGrading (1 $expRatWallP $expRatWall2)
    hex (1 2 6 3 8 9 13 10) ($NRinner $NRouter $Nz) simpleGrading ($expRatWall 1 $expRatWall2)
);

edges
(
	BSpline 1 3 (
		//(0.8 0 0)
		(7.92025e-01 1.12269e-01 0)
		(7.62587e-01 2.22463e-01 0)
		(7.24996e-01 3.26692e-01 0)
		(6.86516e-01 4.21177e-01 0)
		(6.52300e-01 5.02076e-01 0)
		(6.25913e-01 5.66526e-01 0)
		(6.10532e-01 6.10535e-01 0)
	)
	
	BSpline 3 4 (
		(6.10535e-01 6.10532e-01 0)
		(5.66526e-01 6.25913e-01 0)
		(5.02076e-01 6.52300e-01 0)
		(4.21177e-01 6.86516e-01 0)
		(3.26692e-01 7.24996e-01 0)
		(2.22463e-01 7.62587e-01 0)
		(1.12269e-01 7.92025e-01 0)
		//(0 0.8 0)
	)
	BSpline 8 10 (
		//(0.8 0 $h)
		(7.92025e-01 1.12269e-01 $h)
		(7.62587e-01 2.22463e-01 $h)
		(7.24996e-01 3.26692e-01 $h)
		(6.86516e-01 4.21177e-01 $h)
		(6.52300e-01 5.02076e-01 $h)
		(6.25913e-01 5.66526e-01 $h)
		(6.10532e-01 6.10535e-01 $h)
	)
	
	BSpline 10 11 (
		(6.10535e-01 6.10532e-01 $h)
		(5.66526e-01 6.25913e-01 $h)
		(5.02076e-01 6.52300e-01 $h)
		(4.21177e-01 6.86516e-01 $h)
		(3.26692e-01 7.24996e-01 $h)
		(2.22463e-01 7.62587e-01 $h)
		(1.12269e-01 7.92025e-01 $h)
		//(0 0.8 0)
	)
	
	arc 2 6 (0.92387953251128674 0.38268343236508978 0)
	arc 6 5 (0.38268343236508978 0.92387953251128674 0)
	
	arc 9 13 (0.92387953251128674 0.38268343236508978 $h)
	arc 13 12 (0.38268343236508978 0.92387953251128674 $h)
);

boundary
(
    inlet
    {
        type empty;
        faces
        (
            (1 2 6 3)
            (3 6 5 4)
            (0 1 3 4)
        );
    }
    lids
    {
        type wall;
        faces
        (
            (11 10 8 7)
            (12 13 10 11)
            (13 9 8 10)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (9 13 6 2)
            (13 12 5 6)
        );
    }
    symmetryVer
    {
        type empty;
        faces
        (
            (2 9 8 1)
            (1 8 7 0)
        );
    }
    symmetryHor
    {
        type empty;
        faces
        (
            (11 4 0 7)
            (12 5 4 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //