Yigit Dogan-Effects of Aspect Ratio on Spin-Down/Example Case/system/setExprFieldsDict
FoamFile
{
 version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;

}

expressions
(
     
      U
      {
        field U;
        dimensions  [0 1 -1 0 0 0 0];
	
        variables
            (
            "Omega=1"
	    "theta=atan2(pos().y(),pos().x());"	
            );


         condition
	  #{
	 #};

        expression
	#{
 	     vector
		(
		-Omega*sqrt(pos().y()*pos().y()+pos().x()*pos().x())*sin(theta),
		Omega*sqrt(pos().y()*pos().y()+pos().x()*pos().x())*cos(theta),
		0		
		)
	#};

      }      

     



);

